app/controllers/movies_controller.rb

  def show
    @movie = Tmdb::Movie.detail(params[:id])
    @reviews = Review.where(movie_id: @movie['id']).order("created_at DESC")
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? ORDER BY created_at DESC  [["movie_id", 295693]]