app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? ORDER BY created_at DESC  [["movie_id", 295693]]
---
  def index
    @movie = Tmdb::Movie.detail(params[:movie_id])
    @reviews = Review.where(movie_id: @movie['id']).order("created_at DESC")

INSERT INTO "reviews" ("rating", "review", "created_at", "updated_at", "user_id", "movie_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 2], ["review", ""], ["created_at", 2017-04-25 05:52:49 UTC], ["updated_at", 2017-04-25 05:52:49 UTC], ["user_id", 1], ["movie_id", 337339]]
---
  def create
    movie = Tmdb::Movie.detail(params[:id])
    @review = Review.new(review_params)
    @review.user = current_user
    @review.movie_id = params[:movie_id]

    if @review.save